64U128G/memcachedTestResult/memcachedMultiCoreTestResult-5nd-hwBenchmark-gauss82-pipline10/FM-1st/memcached_test_result_P3_FM_OFF_1nd_20230811011955.log
20        Threads
5         Connections per thread
1200      Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         3139.40          ---          ---        60.89982        36.35100       407.55100       839.67900      3375.46 
Gets        12557.25      4190.26      8366.99        60.90299        36.35100       405.50300       835.58300      5245.17 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      15696.65      4190.26      8366.99        60.90235        36.35100       405.50300       835.58300      8620.64 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.095        0.000
SET      19.711        5.000
SET      21.503       10.000
SET      24.191       15.000
SET      25.983       20.000
SET      27.135       25.000
SET      28.287       30.000
SET      29.695       35.000
SET      31.359       40.000
SET      33.791       45.000
SET      36.351       50.000
SET      37.631       52.500
SET      39.167       55.000
SET      40.703       57.500
SET      42.751       60.000
SET      44.799       62.500
SET      46.591       65.000
SET      48.639       67.500
SET      50.943       70.000
SET      53.247       72.500
SET      56.063       75.000
SET      57.599       76.250
SET      59.135       77.500
SET      60.671       78.750
SET      62.719       80.000
SET      64.767       81.250
SET      67.583       82.500
SET      70.143       83.750
SET      73.215       85.000
SET      77.823       86.250
SET      83.455       87.500
SET      86.527       88.125
SET      90.623       88.750
SET      95.231       89.375
SET     100.863       90.000
SET     106.495       90.625
SET     112.127       91.250
SET     117.759       91.875
SET     124.415       92.500
SET     133.119       93.125
SET     146.431       93.750
SET     155.647       94.062
SET     168.959       94.375
SET     188.415       94.688
SET     234.495       95.000
SET     270.335       95.312
SET     276.479       95.625
SET     280.575       95.938
SET     284.671       96.250
SET     288.767       96.562
SET     292.863       96.875
SET     294.911       97.031
SET     296.959       97.188
SET     301.055       97.344
SET     305.151       97.500
SET     311.295       97.656
SET     317.439       97.812
SET     325.631       97.969
SET     331.775       98.125
SET     339.967       98.281
SET     346.111       98.438
SET     350.207       98.516
SET     354.303       98.594
SET     360.447       98.672
SET     366.591       98.750
SET     376.831       98.828
SET     387.071       98.906
SET     403.455       98.984
SET     430.079       99.062
SET     491.519       99.141
SET     548.863       99.219
SET     585.727       99.258
SET     720.895       99.297
SET     733.183       99.336
SET     741.375       99.375
SET     745.471       99.414
SET     749.567       99.453
SET     753.663       99.492
SET     757.759       99.531
SET     761.855       99.570
SET     765.951       99.609
SET     770.047       99.629
SET     770.047       99.648
SET     774.143       99.668
SET     778.239       99.688
SET     782.335       99.707
SET     786.431       99.727
SET     790.527       99.746
SET     794.623       99.766
SET     798.719       99.785
SET     806.911       99.805
SET     806.911       99.814
SET     811.007       99.824
SET     815.103       99.834
SET     815.103       99.844
SET     819.199       99.854
SET     823.295       99.863
SET     827.391       99.873
SET     827.391       99.883
SET     835.583       99.893
SET     839.679       99.902
SET     843.775       99.907
SET     843.775       99.912
SET     847.871       99.917
SET     851.967       99.922
SET     860.159       99.927
SET     864.255       99.932
SET     872.447       99.937
SET     876.543       99.941
SET     884.735       99.946
SET     897.023       99.951
SET     905.215       99.954
SET     909.311       99.956
SET     921.599       99.958
SET     929.791       99.961
SET     937.983       99.963
SET     950.271       99.966
SET     958.463       99.968
SET     966.655       99.971
SET     974.847       99.973
SET     978.943       99.976
SET     983.039       99.977
SET     987.135       99.978
SET     991.231       99.979
SET     991.231       99.980
SET     995.327       99.982
SET     999.423       99.983
SET     999.423       99.984
SET    1003.519       99.985
SET    1007.615       99.987
SET    1011.711       99.988
SET    1015.807       99.988
SET    1015.807       99.989
SET    1019.903       99.990
SET    1019.903       99.990
SET    1023.999       99.991
SET    1023.999       99.991
SET    1023.999       99.992
SET    1028.095       99.993
SET    1028.095       99.993
SET    1032.191       99.994
SET    1032.191       99.994
SET    1032.191       99.995
SET    1032.191       99.995
SET    1032.191       99.995
SET    1036.287       99.995
SET    1036.287       99.996
SET    1036.287       99.996
SET    1036.287       99.996
SET    1040.383       99.997
SET    1040.383       99.997
SET    1040.383       99.997
[...]
SET    1040.383       99.998
SET    1040.383       99.998
SET    1040.383       99.998
SET    1044.479       99.998
SET    1044.479       99.998
SET    1044.479       99.998
[...]
SET    1044.479       99.999
SET    1044.479       99.999
SET    1044.479       99.999
[...]
SET    1048.575       99.999
SET    1048.575      100.000
---
GET       0.087        0.000
GET      19.583        5.000
GET      21.375       10.000
GET      23.935       15.000
GET      25.855       20.000
GET      27.007       25.000
GET      28.287       30.000
GET      29.567       35.000
GET      31.359       40.000
GET      33.791       45.000
GET      36.351       50.000
GET      37.887       52.500
GET      39.423       55.000
GET      40.959       57.500
GET      42.751       60.000
GET      44.799       62.500
GET      46.847       65.000
GET      48.895       67.500
GET      50.943       70.000
GET      53.247       72.500
GET      56.063       75.000
GET      57.599       76.250
GET      59.135       77.500
GET      60.927       78.750
GET      62.719       80.000
GET      64.767       81.250
GET      67.583       82.500
GET      70.143       83.750
GET      73.727       85.000
GET      77.823       86.250
GET      83.455       87.500
GET      87.039       88.125
GET      91.135       88.750
GET      96.255       89.375
GET     101.375       90.000
GET     106.495       90.625
GET     112.127       91.250
GET     117.759       91.875
GET     124.415       92.500
GET     133.119       93.125
GET     146.431       93.750
GET     156.671       94.062
GET     168.959       94.375
GET     189.439       94.688
GET     238.591       95.000
GET     270.335       95.312
GET     276.479       95.625
GET     280.575       95.938
GET     284.671       96.250
GET     288.767       96.562
GET     292.863       96.875
GET     294.911       97.031
GET     299.007       97.188
GET     301.055       97.344
GET     305.151       97.500
GET     311.295       97.656
GET     317.439       97.812
GET     323.583       97.969
GET     331.775       98.125
GET     337.919       98.281
GET     344.063       98.438
GET     348.159       98.516
GET     352.255       98.594
GET     358.399       98.672
GET     364.543       98.750
GET     374.783       98.828
GET     385.023       98.906
GET     401.407       98.984
GET     428.031       99.062
GET     489.471       99.141
GET     544.767       99.219
GET     581.631       99.258
GET     720.895       99.297
GET     733.183       99.336
GET     741.375       99.375
GET     745.471       99.414
GET     749.567       99.453
GET     753.663       99.492
GET     757.759       99.531
GET     761.855       99.570
GET     765.951       99.609
GET     770.047       99.629
GET     770.047       99.648
GET     774.143       99.668
GET     778.239       99.688
GET     782.335       99.707
GET     786.431       99.727
GET     790.527       99.746
GET     794.623       99.766
GET     798.719       99.785
GET     802.815       99.805
GET     806.911       99.814
GET     811.007       99.824
GET     811.007       99.834
GET     815.103       99.844
GET     819.199       99.854
GET     819.199       99.863
GET     823.295       99.873
GET     827.391       99.883
GET     831.487       99.893
GET     835.583       99.902
GET     839.679       99.907
GET     843.775       99.912
GET     847.871       99.917
GET     851.967       99.922
GET     856.063       99.927
GET     860.159       99.932
GET     868.351       99.937
GET     872.447       99.941
GET     880.639       99.946
GET     888.831       99.951
GET     897.023       99.954
GET     901.119       99.956
GET     909.311       99.958
GET     917.503       99.961
GET     929.791       99.963
GET     937.983       99.966
GET     950.271       99.968
GET     958.463       99.971
GET     970.751       99.973
GET     974.847       99.976
GET     978.943       99.977
GET     983.039       99.978
GET     987.135       99.979
GET     987.135       99.980
GET     991.231       99.982
GET     995.327       99.983
GET     999.423       99.984
GET    1003.519       99.985
GET    1007.615       99.987
GET    1007.615       99.988
GET    1011.711       99.988
GET    1011.711       99.989
GET    1015.807       99.990
GET    1015.807       99.990
GET    1019.903       99.991
GET    1019.903       99.991
GET    1023.999       99.992
GET    1023.999       99.993
GET    1028.095       99.993
GET    1028.095       99.994
GET    1028.095       99.994
GET    1032.191       99.995
GET    1032.191       99.995
GET    1032.191       99.995
[...]
GET    1036.287       99.996
GET    1036.287       99.996
GET    1036.287       99.996
GET    1036.287       99.997
GET    1040.383       99.997
GET    1040.383       99.997
GET    1040.383       99.997
[...]
GET    1040.383       99.998
GET    1040.383       99.998
GET    1044.479       99.998
GET    1044.479       99.998
GET    1044.479       99.998
[...]
GET    1044.479       99.999
GET    1044.479       99.999
GET    1044.479       99.999
GET    1048.575       99.999
GET    1048.575      100.000
---
WAIT      0.000      100.000